config.org
#+TITLE: Minha configuração do Emacs
#+AUTHOR: tukainpng

* Configurações do ambiente

** Interface
#+begin_src elisp
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (global-display-line-numbers-mode 1)
  ;(load-theme 'modus-vivendi t)
  (setq inhibit-startup-screen t)
  (set-frame-font "-JB-JetBrainsMono Nerd Font Mono-regular-normal-normal-*-*-*-*-*-m-0-iso10646-1" nil t)
#+end_src

** Auto-save
#+begin_src elisp
  (setq backup-directory-alist '(("." . "~/.config/emacs/auto-save-list")))
#+end_src

** Ido-mode
#+begin_src elisp
  (require 'ido)
  (ido-mode 1)
#+end_src

** Org-mode
#+begin_src elisp
  (require 'org-tempo)
  (setq org-support-shift-select 1)
  (electric-indent-mode -1)
#+end_src

** Use-package
#+begin_src elisp
  (require 'package)
  (add-to-list 'package-archives '("gnu"   . "https://elpa.gnu.org/packages/"))
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
  (package-initialize)

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (eval-and-compile
    (setq use-package-always-ensure t
	  use-package-expand-minimally t))
#+end_src

** EasyPG
#+begin_src elisp
  (require 'epa-file)
  (epa-file-enable)
  (setq epa-pinentry-mode 'loopback)
#+end_src

* Pacotes

** Which-key
#+begin_src elisp
  (use-package which-key
    :ensure t
    :init (which-key-mode 1))
#+end_src

** Company
#+begin_src elisp
  (use-package company
    :ensure t)
#+end_src

** Smex
#+begin_src elisp
  (use-package smex
    :ensure t
    :config
    (global-set-key (kbd "M-x") 'smex))
#+end_src

** Evil
#+begin_src elisp
  (use-package evil
    :ensure t
    :init (evil-mode 1))
#+end_src

** Magit
#+begin_src elisp
  (use-package magit
    :ensure t)
#+end_src

** Telephone line
#+begin_src elisp
  (use-package telephone-line
    :ensure t
    :init (telephone-line-mode 1))
#+end_src

** Highlight Parenthesis
#+begin_src elisp
  (use-package highlight-parentheses
    :ensure t
    :init (highlight-parentheses-mode 1))
#+end_src

** Org-bullets
#+begin_src elisp
  (use-package org-bullets
    :ensure t
    :init (org-bullets-mode 1))
#+end_src

** DOOM Themes
#+begin_src elisp
  (use-package doom-themes
    :ensure t
    :init (load-theme 'doom-one t))
#+end_src

* Teclas de atalho
#+begin_src elisp
  (keymap-global-set "C-<tab> g" 'magit)
  (keymap-global-set "C-<tab> s" 'eshell)
  (keymap-global-set "C-<tab> c" 'company-mode)
  (keymap-global-set "C-x C-b" 'ibuffer)
#+end_src
